/*************************************************************************************************
    文 件 名：tcp.c
    代码作者：liujie
    编写版本：V1.0.0.0 
    创建日期：2016-07-14
    功能描述：socket通讯模块
 *************************************************************************************************/
#include	"load.h"
#include	"cts.h"
#include	"adapter.h"
#include    <curl/curl.h>


/*************************************************************************************************
	全局定义区
 ************************************************************************************************/
CURLFORMcode    g_FmtCode = 0;
CURLcode        g_Code = 0;
CURL            *g_Curl = NULL;
CurlHttp        *g_Post = NULL, *g_Last = NULL;

/*************************************************************************************************
 *     宏定义区
  ************************************************************************************************/
#define PCUrl_Fromadd(t, n, e, v)                                                       \
    g_FmtCode = curl_formadd(&g_Post, &g_Last, t, n, e, v, CURLFORM_END);               \
    if(CURLE_OK != g_FmtCode)                                                           \
        SYSError(RET_SYSTEM, "code(%d), %s\n", g_FmtCode, curl_easy_strerror(g_FmtCode));       

#define PCUrl_Setopt(t, c)                                                          \
    g_Code = curl_easy_setopt(g_Curl, t, c);                                        \
    if(CURLE_OK != g_Code)                                                          \
        SYSError(RET_SYSTEM, "code(%d), %s\n", g_Code, curl_easy_strerror(g_Code));     

#define PCUrl_Initail()                                                             \
    curl_global_init(CURL_GLOBAL_ALL);                                              \
    vSetRetCode(RET_SUCCESS);                                                       \
    g_FmtCode = 0;                                                                  \
    g_Code = 0;                                                                     \
    g_Curl = NULL;                                                                  \
    g_Post = NULL;                                                                  \
    g_Last = NULL;

/*************************************************************************************************
 *     函数定义区
 ************************************************************************************************/




/*************************************************************************************************
 * 	code end
 *************************************************************************************************/
