/**************************************************************************************************
	文 件 名：cts_mon.c
	代码作者：DeffPuzzL
	编写版本：V3.0.0.0 
	创建日期：2016-07-14
	功能描述：用户自定义函数处理
 **************************************************************************************************/
#include	"face.h"

/**************************************************************************************************
	函 数 名：lPackDllTest(SATvm *pstSamo, char *pszOut, long *plLen)
	功能描述：显示该应用的版本
	返回说明：
		无
 **************************************************************************************************/
long	lPackDllTest(SATvm *pstSamo, char *pszOut, long *plLen)
{
	GCts	*pstCts = (GCts *)pGetGloble();

	IBPrace("Pack(%d):\n%s", *plLen, pszOut);
	IBPputstringofs(0, "tx_date", 8, pszOut);
	IBPputstring("order_no", pszOut + 8);
	IBPputstring("TX_NAME", "DEFFPUZZL");

	return RC_SUCC;
}


/**************************************************************************************************
	code end
 **************************************************************************************************/
